# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
# your code here
temp = pd.read_csv('Temp_States.csv')
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

In [4]:
temp.shape

(7, 3)

#### Print `temp`.

In [5]:
display(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [8]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
We can use the method df.dtypes to understand each column what kind of data does it has, in order to know how we could work
with them.
"""

#### Select the rows where state is New York.

In [11]:
# your code here
# we select the rows with a boolean mask equals to New York
temp[temp['State'] == 'New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [27]:
# your code here
avg_temp_NY = temp[temp['State'] == 'New York'].agg({'Temperature':'mean'})
avg_temp_NY

Temperature    10.740741
dtype: float64

In [26]:
NY = temp[temp['State'] == 'New York']
print("average temperature of cities in New York: ", np.mean(NY['Temperature']))

average temperature of cities in New York:  10.74074074074074

In [28]:
NY['Temperature'].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [47]:
# your code here
temp[['City','State']][temp['Temperature']>15]

       City        State
0       NYC     New York
3  Hartford  Connecticut
5    Treton   New Jersey
6    Newark   New Jersey

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [48]:
# your code here
temp[['City']][temp['Temperature']>15]

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [71]:
# your code here
temp[['City']][(temp['Temperature']>15)&(temp['Temperature']<20)]

       City
0       NYC
3  Hartford

#### Find the mean and standard deviation of the temperature of each state.

In [62]:
# your code here
temp.groupby(['State'])['Temperature'].std()

State
Connecticut    1.964186
New Jersey     1.571348
New York       8.133404
Name: Temperature, dtype: float64

In [63]:
temp.groupby(['State'])['Temperature'].agg('std')

State
Connecticut    1.964186
New Jersey     1.571348
New York       8.133404
Name: Temperature, dtype: float64

In [98]:
#trying to calculate it by filtering, not sure if possible
temp[temp['State'][temp['Temperature'].std()]]

KeyError: 6.695264939070775

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [106]:
# your code here
employees = pd.read_csv('Employee.csv')
employees.shape

(9, 7)

In [107]:
employees.sample(4)

    Name Department Education Gender      Title  Years  Salary
1  Maria         IT    Master      F    analyst      2      30
2  David         HR    Master      M    analyst      2      30
7  Pedro         IT       Phd      M  associate      7      60
0   Jose         IT  Bachelor      M    analyst      1      35

#### Explore the data types of the `employees` dataframe. Comment your results.

In [105]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
We have 2 columns as intwegers, the res are consider objects ,mainly strings. It is a daframe size 9x7
"""

#### What's the average salary in this company?

In [109]:
# your code here
print("average salary in this company: ", employees['Salary'].mean())

average salary in this company:  48.888888888888886

#### What's the highest salary?

In [112]:
# your code here
print("Higher Salary: ", employees['Salary'].max())

Higher Salary:  70

#### What's the lowest salary?

In [113]:
# your code here
print("Lowest Salary: ", employees['Salary'].min())

Lowest Salary:  30

#### Who are the employees with the lowest salary?

In [132]:
# your code here
employees[['Name']][employees['Salary']==(employees['Salary'].min()) ]

    Name
1  Maria
2  David

In [135]:
employees[employees['Salary']== 30]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [136]:
employees[employees['Salary']== employees['Salary'].min()]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [137]:
# your code here
employees[employees['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [176]:
# your code here

david_salary = employees[['Salary']][employees['Name']== 'David' ]
salary = david_salary["Salary"].values[0]
salary

30

#### Print all the rows where job title is associate.

In [183]:
# your code here
employees[employees['Title']== 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [193]:
# Method 1
# your code here
employees.iloc[0:3,:]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [197]:
# Method 2
# your code here
employees.filter(items =[0,1,2], axis=0)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [198]:
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [200]:
# your code here
employees[(employees['Title'] == 'associate') & (employees['Salary'] > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [202]:
# your code here
employees.groupby(['Years']).agg({'Salary':'mean'})

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [203]:
# your code here
employees.groupby(['Title']).agg('mean')

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  Find the salary quartiles.

In [212]:
# your code here
employees['Salary'].quantile([.25,.5,.75,1])

0.25    35.0
0.50    55.0
0.75    60.0
1.00    70.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [214]:
# your code here
employees.groupby(['Gender']).agg({'Salary':'mean'})
#Yes is lower for Females

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [233]:
# your code here
def min_mean_max_calc(col):
    # The funtion will give the minimum, mean and maximum of any column
    min = col.min()
    print("Minumum: ", min)
    mean = col.mean()
    print("Mean: ", mean)
    max = col.max()
    print("Max: ", max)

In [234]:
print("Years")
print(min_mean_max_calc(employees['Years']))
print("Salary")
print(min_mean_max_calc(employees['Salary']))

Years
Minumum:  1
Mean:  4.111111111111111
Max:  8
None
Salary
Minumum:  30
Mean:  48.888888888888886
Max:  70
None

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [245]:
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [235]:
def difference_of_salary(col):
    return col.max()-col.min()

In [244]:
# your code here
employees.groupby(['Department'])['Salary'].agg(difference_of_salary)

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

In [246]:
employees.groupby(['Department'])['Salary'].apply(difference_of_salary)

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

In [247]:
employees.groupby(['Department'])['Salary'].apply(lambda x: x.max()-x.min() )

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here